// Завдання 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

// let str = "";
//
// for (let i = 20; i < 31; i = i + 0.5) {
//     str += i + " ";
// }
// console.log(str);

// Завдання 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

// let result;
//
// for (let i = 10; i < 101; i = i + 10) {
//     result = i * 27;
//     console.log(result);
// }

// Завдання 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

// let Num = +prompt("Введіть натуральне число");
//
// for (let i = 1; i < 101; i++) {
//     if (i * i < Num) {
//        console.log(i)
//     }
// }

// Завдання 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1,
// які не мають інших дільників крім 1 і себе).

// let num = +prompt("Введіть число");
//
// function resNum(num) {
//         for (let i = 2; i < num; i++) {
//             if (num % i === 0) {
//                 return "Складене число";
//             }
//         }
//         return "Просте число";
//  }
// console.log(resNum(num));

//Завдання 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

function resNum(num) {
    while (num % 3 === 0) {
        num /= 3;
    }
    return num === 1;
}

console.log(resNum(9));
