// Завдання 1 Вивести на сторінку в один рядок через кому числа від 10 до 20.

// let str = "";
//
// for (let i = 20; i < 31; i++) {
//     str += i + ", ";
// }
// console.log(str);

// Завдання 2 Вивести квадрати чисел від 10 до 20.

// let num = 19;
// let pow
//
// while (num < 30) {
//     num++
//     pow = num ** 2
//     console.log(pow)
// }

// Завдання 3 Вивести таблицю множення на 7.

// let mult = 1
//
// while (mult < 11) {
//     result = 7 * mult
//     console.log(`7 * ${mult} = ${result}`)
//     mult++
// }

// Завдання 4 Знайти суму всіх цілих чисел від 1 до 15.

// let sum = 0
//
// for (let i = 0; i < 16; i++) {
//     sum = sum + i
// }
//     console.log(sum)

// Завдання 5 Знайти добуток усіх цілих чисел від 15 до 35.

// let mult = 15
//
// for (let i = 16; i < 36; i++) {
//     mult = mult * i
// }
//     console.log(mult)

// Завдання 6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500.

// let sum = 0
//
// for (let i = 0; i < 501; i++) {
//     sum = (sum + i)
// }
// console.log(sum / 500)

// Завдання 7 Вивести суму лише парних чисел в діапазоні від 30 до 80.

// let sum = 30
// for (let i = 32; i < 81; i++) {
//     if (i % 2 === 0) {
//         sum = (sum + i)
//     }
// }
// console.log(sum)

// Завдання 8 Вивести всі числа в діапазоні від 100 до 200 кратні 3.

// for (let i = 100; i < 200; i++) {
//     if (i % 3 === 0) {
//         console.log(i);
//     }
// }

// Завдання 9 Дано натуральне число. Знайти та вивести на сторінку всі його дільники.

// let num = 15

// for (let i = 1; i <= num; i++) {
//     if (num % i === 0) {
//         console.log(i);
//     }
// }

// Завдання 9-11. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників, знайти суму його парних дільників.

let Num = +prompt("Введіть натуральне число");
let count = 0;
let sum = 0;

for (let i = 1; i <= Num; i++) {
    if (Num % i === 0) {
            if (i % 2 === 0) {
            count++;
            sum += i;
        }
        console.log(i)
    }
}
alert(`Кількість парних дільників: ${count}
Сума парних дільників: ${sum}`);

// Завдання 12 Таблиця множення від 1 до 10
// let mult
// for (i = 1; i <= 10; i++) {
//     for (j = 1; j <= 10; j++) {
//         mult = i * j
//         console.log(`${i} * ${j} = ${mult}`)
//     }
// }



